Repository: 84000/data-translation-memory
Catalog: Toh_846a-Threefold_Ritual-v2.tmx
Source language: bo
Languages: en

source: རྒྱུད་གསུམ་པ།
en: The Threefold Ritual

source: ཚངས་པ་བརྒྱ་བྱིན་རྒྱལ་ཆེན་ལྷ་དང་ཀླུ། །གནོད་སྦྱིན་དྲི་ཟ་ལྟོ་འཕྱེ་ལྷ་མ་ཡིན། །གསེར་འདབ་གྲུལ་བུམ་མིའམ་ཅི་ལ་སོགས། །སེམས་ཅན་གང་དག་བདེ་གཤེགས་སྲས་རྣམས་དང་། །ནོར་བདུན་ཕུན་སུམ་དཔལ་བཞེད་ཀུན་གསོན་ཅིག །
en: Brahmā, great king Śakra, gods and nāgas, Yakṣas, gandharvas, uragas, asuras, Garuḍas, kumbhāṇḍas, kinnaras, All beings who are sons of the Sugata, Accept these seven wonderful and resplendent jewels and listen to me.

source: སངས་རྒྱས་བཅོམ་ལྡན་ཡོན་ཏན་བསམ་མི་ཁྱབ། །
en: The qualities of the blessed Buddha are inconceivable.

source: དམ་པའི་ཆོས་ཀྱི་ཡོན་ཏན་བསམ་མི་ཁྱབ། །
en: The qualities of the holy Dharma are inconceivable.

source: འཕགས་པའི་དགེ་འདུན་ཡོན་ཏན་བསམ་མི་ཁྱབ། །
en: The qualities of the noble Saṅgha are inconceivable.

source: དཀོན་མཆོག་བསམ་མི་ཁྱབ་ལ་མངོན་དད་པའི། །རྣམ་སྨིན་བླ་ན་མེད་པའང་བསམ་མི་ཁྱབ། །
en: The unsurpassed fruition of true faith In the inconceivable Three Jewels is inconceivable.

source: བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བགྲང་བར་ཡང་། །དཀོན་མཆོག་མཚན་ཐོས་ཙམ་ཡང་རྙེད་དཀའ་བས། །
en: It is rare to hear so much as the names of the Three Jewels, Even over the course of millions of eons.

source: བརྒྱ་ལམ་ལན་ཅིག་ཁོམ་ལྡན་ལུས་རྙེད་རྣམས། །རྫུ་འཕྲུལ་དད་པའི་ཤུགས་ཀྱིས་འདིར་གཤེགས་ཏེརྣམ་པར་གྲོལ་བའི་རིན་ཆེན་སྣ་ཚོགས་གླིང་། །ཟབ་མོ་རྒྱལ་བའི་བཀའ་ལ་ཀུན་གསོན་ཅིག །
en: Now that you have taken such a rare embodiment endowed with the freedoms, Use the energy of your magical abilities and faith to approach, And listen to the profound teaching of the Victor In this sanctuary bedecked with the jewels of liberation.

source: བསྔོ་བ་གང་དག་དམ་ཆོས་ལྷུར་ལེན་འདིར་འདུས་པ། །ལྷ་ཀླུ་གནོད་སྦྱིན་ལ་སོགས་མཐུ་ཆེན་རྣམས། །ཆོས་ཀྱི་བསོད་ནམས་ཤས་ཀྱང་ཁྱེད་བཞེས་ཏེ། །
en: May those who gather here intent upon the holy Dharma, Such as powerful gods, nāgas, yakṣas, and the like, Accept this share of Dharma merit:

source: གཟི་བྱིན་འཁོར་འཕེལ་དགོངས་པ་གྲུབ་པར་བསྔོ། །
en: we dedicate it So that you may increase in splendor and retinue and accomplish what you desire.

source: གསུང་རབ་བདུད་རྩིའི་རྗེས་སུ་བསྒྲུབ་མཛོད་ལ། །གང་ལ་ཅི་རིགས་སོ་སོར་དཔལ་བསྐྱེད་ཅིང་། །དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་བསྲུང་བར་གསོལ། །
en: May you obtain the nectar of the teachings, Bring prosperity to each and every class of beings wherever they are, And protect the teachings of the tathāgatas.

source: རྒྱུད་གསུམ་པ་རྫོགས་སོ།།
en: This concludes “The Threefold Ritual.”
